src/InformationRegisters/СнимкиОнлайнДанныхТерминала/СнимкиОнлайнДанныхТерминала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СнимкиОнлайнДанныхТерминала</name>
  <resources>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>BuildId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеJSON</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоОбъектов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредупрежденияJSON</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДлительностьОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ХэшДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Раздел</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПоложениеТехникиСкаут/ПоложениеТехникиСкаут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоложениеТехникиСкаут</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодТипаТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Азимут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Скорость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоординатаX</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоординатаY</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТипТехники</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отображать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СКонтейнером</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Информация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ОбновлениеОнлайнДанныхТерминала/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Точка входа регламентного задания ПолучитьСудаEDS.
Процедура ОбновитьСудаEDS() Экспорт

	Если Не РежимРеальныхДанныхВключен() Тогда
		Возврат;
	КонецЕсли;

	Если ЗаданиеМетодаУжеВыполняется(ИмяМетодаСудов()) Тогда
		Возврат;
	КонецЕсли;

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Попытка
		Обработка = Обработки.d3_v4.Создать();
		Снимок = Обработка.СобратьСнимокСудовEDS();
		ЗаписатьСнимокРаздела(
			ИсточникEDS(),
			РазделСуда(),
			Снимок.Объекты,
			Снимок.Предупреждения,
			Обработка.ПолучитьИдентификаторСборкиСцены(),
			ДлительностьСекунд(Начало),
			Обработка);
	Исключение
		ЗаписатьОшибку("EDS.ОбновлениеСудов", ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

// Точка входа регламентного задания ПолучитьВагоныУПП.
Процедура ОбновитьВагоныУПП() Экспорт

	Если Не РежимРеальныхДанныхВключен() Тогда
		Возврат;
	КонецЕсли;

	Если ЗаданиеМетодаУжеВыполняется(ИмяМетодаВагонов()) Тогда
		Возврат;
	КонецЕсли;

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Попытка
		Обработка = Обработки.d3_v4.Создать();
		Снимок = Обработка.СобратьСнимокВагоновУПП();
		ЗаписатьСнимокРаздела(
			ИсточникУПП(),
			РазделВагоны(),
			Снимок.Объекты,
			Снимок.Предупреждения,
			Обработка.ПолучитьИдентификаторСборкиСцены(),
			ДлительностьСекунд(Начало),
			Обработка);
	Исключение
		ЗаписатьОшибку("УПП.ОбновлениеВагонов", ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

// Точка входа регламентного задания ПолучитьНаполнениеПлощадокУКТ.
Процедура ОбновитьНаполнениеПлощадокУКТ() Экспорт

	Если Не РежимРеальныхДанныхВключен() Тогда
		Возврат;
	КонецЕсли;

	Если ЗаданиеМетодаУжеВыполняется(ИмяМетодаУКТ()) Тогда
		Возврат;
	КонецЕсли;

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Попытка
		Обработка = Обработки.d3_v4.Создать();
		Снимок = Обработка.СобратьСнимокУКТ();
		ЗаписатьСнимкиУКТ(Снимок, Обработка, ДлительностьСекунд(Начало));
	Исключение
		ЗаписатьОшибку("УКТ.ОбновлениеНаполнения", ИнформацияОбОшибке());
	КонецПопытки;

КонецПроцедуры

// Запускает тот же метод, что и регламент ПолучитьСудаEDS.
Процедура ЗапуститьОбновлениеСудовEDS() Экспорт

	ЗапуститьМетодОбновления(ИмяМетодаСудов(), "Обновление судов EDS");

КонецПроцедуры

// Запускает тот же метод, что и регламент ПолучитьВагоныУПП.
Процедура ЗапуститьОбновлениеВагоновУПП() Экспорт

	ЗапуститьМетодОбновления(ИмяМетодаВагонов(), "Обновление вагонов УПП");

КонецПроцедуры

// Запускает тот же метод, что и регламент ПолучитьНаполнениеПлощадокУКТ.
Процедура ЗапуститьОбновлениеНаполненияПлощадокУКТ() Экспорт

	ЗапуститьМетодОбновления(ИмяМетодаУКТ(), "Обновление наполнения площадок УКТ");

КонецПроцедуры

// Возвращает совместимый снимок раздела или Неопределено.
//
// Параметры:
//  Источник - Строка - EDS, УПП или УКТ;
//  Раздел - Строка - Vessels, Wagons, Placements или Cells;
//  BuildId - Строка - идентификатор текущей сборки сцены.
//
// Возвращаемое значение:
//  Структура, Неопределено - дата, данные и предупреждения совместимого снимка.
Функция ПрочитатьСовместимыйСнимок(Источник, Раздел, BuildId) Экспорт

	Запись = ПрочитатьЗаписьСнимка(Источник, Раздел);
	Если Запись = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Если Строка(Запись.BuildId) <> Строка(BuildId) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Обработка = Обработки.d3_v4.Создать();
	Результат = Новый Структура;
	Результат.Вставить("ДатаПолучения", Запись.ДатаПолучения);
	Результат.Вставить("Данные", Обработка.ПрочитатьОбъектыСцены(Запись.ДанныеJSON));
	Результат.Вставить("Предупреждения", Обработка.ПрочитатьОбъектыСцены(Запись.ПредупрежденияJSON));
	Возврат Результат;

КонецФункции

// Читает снимки EDS/УПП/УКТ и период Скаут для polling формы.
//
// Параметры:
//  Версии - Структура - известные клиенту даты слоёв.
//
// Возвращаемое значение:
//  Структура:
//   * РежимРеальныхДанных - Булево - текущее значение константы;
//   * Техника - Структура - секция Скаут;
//   * EDS - Структура - секция судов;
//   * УПП - Структура - секция вагонов;
//   * УКТ - Структура - секция размещений.
Функция ПолучитьОбновленияСнимков(Версии) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("РежимРеальныхДанных", РежимРеальныхДанныхВключен());
	Результат.Вставить("Техника", СобратьСекциюТехники(Версии.ПериодТехники));

	BuildId = "";
	Попытка
		BuildId = Обработки.d3_v4.Создать().ПолучитьИдентификаторСборкиСцены();
	Исключение
		BuildId = "";
	КонецПопытки;

	Результат.Вставить("EDS", СобратьСекциюСнимка(ИсточникEDS(), РазделСуда(), Версии.ДатаEDS, BuildId));
	Результат.Вставить("УПП", СобратьСекциюСнимка(ИсточникУПП(), РазделВагоны(), Версии.ДатаУПП, BuildId));
	Результат.Вставить("УКТ", СобратьСекциюСнимка(ИсточникУКТ(), РазделРазмещения(), Версии.ДатаУКТ, BuildId));
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РежимРеальныхДанныхВключен()

	Возврат Константы.ПолучениеРеальныхДанных.Получить();

КонецФункции

Функция ИсточникEDS()

	Возврат "EDS";

КонецФункции

Функция ИсточникУПП()

	Возврат "УПП";

КонецФункции

Функция ИсточникУКТ()

	Возврат "УКТ";

КонецФункции

Функция РазделСуда()

	Возврат "Vessels";

КонецФункции

Функция РазделВагоны()

	Возврат "Wagons";

КонецФункции

Функция РазделРазмещения()

	Возврат "Placements";

КонецФункции

Функция РазделЯчейки()

	Возврат "Cells";

КонецФункции

Функция ИмяМетодаСудов()

	Возврат Метаданные.РегламентныеЗадания.ПолучитьСудаEDS.ИмяМетода;

КонецФункции

Функция ИмяМетодаВагонов()

	Возврат Метаданные.РегламентныеЗадания.ПолучитьВагоныУПП.ИмяМетода;

КонецФункции

Функция ИмяМетодаУКТ()

	Возврат Метаданные.РегламентныеЗадания.ПолучитьНаполнениеПлощадокУКТ.ИмяМетода;

КонецФункции

Процедура ЗапуститьМетодОбновления(ИмяМетода, НаименованиеЗадания)

	Если Не РежимРеальныхДанныхВключен() Тогда
		Возврат;
	КонецЕсли;
	Если ЗаданиеМетодаАктивно(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	ФоновыеЗадания.Выполнить(ИмяМетода, , , НаименованиеЗадания);

КонецПроцедуры

Функция ЗаданиеМетодаАктивно(ИмяМетода)

	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", ИмяМетода);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	Найденные = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Возврат Найденные.Количество() > 0;

КонецФункции

Функция ЗаданиеМетодаУжеВыполняется(ИмяМетода)

	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", ИмяМетода);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	Найденные = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);

	ТекущееЗадание = Неопределено;
	Попытка
		ТекущееЗадание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	Исключение
		ТекущееЗадание = Неопределено;
	КонецПопытки;

	Для Каждого Задание Из Найденные Цикл
		Если ТекущееЗадание <> Неопределено
			И Задание.УникальныйИдентификатор = ТекущееЗадание.УникальныйИдентификатор Тогда
			Продолжить;
		КонецЕсли;
		Возврат Истина;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

Функция ДлительностьСекунд(НачалоМс)

	Разница = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоМс;
	Если Разница < 0 Тогда
		Возврат 0;
	КонецЕсли;
	Возврат Цел(Разница / 1000);

КонецФункции

Функция ХэшСтроки(Текст)

	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(Текст);
	Возврат НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеширование.ХешСумма));

КонецФункции

Функция КоличествоОбъектовСнимка(Данные)

	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		Возврат Данные.Количество();
	КонецЕсли;
	Возврат 0;

КонецФункции

Функция НормализоватьПредупреждения(Предупреждения)

	Если ТипЗнч(Предупреждения) = Тип("Массив") Тогда
		Возврат Предупреждения;
	КонецЕсли;
	Возврат Новый Массив;

КонецФункции

Процедура ЗаписатьСнимокРаздела(Источник, Раздел, Данные, Предупреждения, BuildId, Длительность, Обработка)

	ТекстДанных = Обработка.СериализоватьОбъектыСцены(Данные);
	ТекстПредупреждений = Обработка.СериализоватьОбъектыСцены(НормализоватьПредупреждения(Предупреждения));

	Набор = РегистрыСведений.СнимкиОнлайнДанныхТерминала.СоздатьНаборЗаписей();
	Набор.Отбор.Источник.Установить(Источник);
	Набор.Отбор.Раздел.Установить(Раздел);
	Запись = Набор.Добавить();
	Запись.Источник = Источник;
	Запись.Раздел = Раздел;
	Запись.ДатаПолучения = ТекущаяДатаСеанса();
	Запись.BuildId = BuildId;
	Запись.ДанныеJSON = ТекстДанных;
	Запись.КоличествоОбъектов = КоличествоОбъектовСнимка(Данные);
	Запись.ПредупрежденияJSON = ТекстПредупреждений;
	Запись.ДлительностьОбновления = Длительность;
	Запись.ХэшДанных = ХэшСтроки(ТекстДанных);
	Набор.Записать();

КонецПроцедуры

Процедура ЗаписатьСнимкиУКТ(Снимок, Обработка, Длительность)

	BuildId = Обработка.ПолучитьИдентификаторСборкиСцены();
	ДатаПолучения = ТекущаяДатаСеанса();
	ТекстРазмещений = Обработка.СериализоватьОбъектыСцены(Снимок.Размещения);
	ТекстЯчеек = Обработка.СериализоватьОбъектыСцены(Снимок.Ячейки);
	ТекстПредупреждений = Обработка.СериализоватьОбъектыСцены(НормализоватьПредупреждения(Снимок.Предупреждения));
	ХэшРазмещений = ХэшСтроки(ТекстРазмещений);
	ХэшЯчеек = ХэшСтроки(ТекстЯчеек);

	НачатьТранзакцию();
	Попытка
		ЗаписатьГотовуюСтрокуСнимка(
			ИсточникУКТ(),
			РазделРазмещения(),
			ДатаПолучения,
			BuildId,
			ТекстРазмещений,
			КоличествоОбъектовСнимка(Снимок.Размещения),
			ТекстПредупреждений,
			Длительность,
			ХэшРазмещений);
		ЗаписатьГотовуюСтрокуСнимка(
			ИсточникУКТ(),
			РазделЯчейки(),
			ДатаПолучения,
			BuildId,
			ТекстЯчеек,
			КоличествоОбъектовСнимка(Снимок.Ячейки),
			ТекстПредупреждений,
			Длительность,
			ХэшЯчеек);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура ЗаписатьГотовуюСтрокуСнимка(
	Источник,
	Раздел,
	ДатаПолучения,
	BuildId,
	ТекстДанных,
	КоличествоОбъектов,
	ТекстПредупреждений,
	Длительность,
	ХэшДанных)

	Набор = РегистрыСведений.СнимкиОнлайнДанныхТерминала.СоздатьНаборЗаписей();
	Набор.Отбор.Источник.Установить(Источник);
	Набор.Отбор.Раздел.Установить(Раздел);
	Запись = Набор.Добавить();
	Запись.Источник = Источник;
	Запись.Раздел = Раздел;
	Запись.ДатаПолучения = ДатаПолучения;
	Запись.BuildId = BuildId;
	Запись.ДанныеJSON = ТекстДанных;
	Запись.КоличествоОбъектов = КоличествоОбъектов;
	Запись.ПредупрежденияJSON = ТекстПредупреждений;
	Запись.ДлительностьОбновления = Длительность;
	Запись.ХэшДанных = ХэшДанных;
	Набор.Записать();

КонецПроцедуры

Функция ПрочитатьЗаписьСнимка(Источник, Раздел)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Снимки.ДатаПолучения КАК ДатаПолучения,
	|	Снимки.BuildId КАК BuildId,
	|	Снимки.ДанныеJSON КАК ДанныеJSON,
	|	Снимки.ПредупрежденияJSON КАК ПредупрежденияJSON,
	|	Снимки.КоличествоОбъектов КАК КоличествоОбъектов
	|ИЗ
	|	РегистрСведений.СнимкиОнлайнДанныхТерминала КАК Снимки
	|ГДЕ
	|	Снимки.Источник = &Источник
	|	И Снимки.Раздел = &Раздел";
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("Раздел", Раздел);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запись = Новый Структура;
	Запись.Вставить("ДатаПолучения", Выборка.ДатаПолучения);
	Запись.Вставить("BuildId", Выборка.BuildId);
	Запись.Вставить("ДанныеJSON", Выборка.ДанныеJSON);
	Запись.Вставить("ПредупрежденияJSON", Выборка.ПредупрежденияJSON);
	Запись.Вставить("КоличествоОбъектов", Выборка.КоличествоОбъектов);
	Возврат Запись;

КонецФункции

Функция ПустаяСекцияСнимка()

	Результат = Новый Структура;
	Результат.Вставить("ЕстьИзменения", Ложь);
	Результат.Вставить("ДатаСнимка", Неопределено);
	Результат.Вставить("Объекты", Неопределено);
	Результат.Вставить("Предупреждения", Новый Массив);
	Результат.Вставить("Ошибка", Ложь);
	Результат.Вставить("ТекстОшибки", "");
	Результат.Вставить("ДлительностьЗапросаМс", 0);
	Результат.Вставить("ДлительностьРазбораМс", 0);
	Результат.Вставить("ДлинаJSON", 0);
	Результат.Вставить("КоличествоОбъектов", 0);
	Результат.Вставить("ДанныеJSON", "");
	Возврат Результат;

КонецФункции

Функция СобратьСекциюСнимка(Источник, Раздел, ДатаКлиента, BuildId)

	Результат = ПустаяСекцияСнимка();
	Попытка
		НачалоЗапроса = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Запись = ПрочитатьЗаписьСнимка(Источник, Раздел);
		Результат.ДлительностьЗапросаМс = ДлительностьМиллисекунд(НачалоЗапроса);
		Если Запись = Неопределено Или Строка(Запись.BuildId) <> Строка(BuildId) Тогда
			Возврат Результат;
		КонецЕсли;
		Результат.ДатаСнимка = Запись.ДатаПолучения;
		Результат.ДлинаJSON = СтрДлина(Строка(Запись.ДанныеJSON));
		Результат.КоличествоОбъектов = Запись.КоличествоОбъектов;
		Если ДатаКлиента = Неопределено Или Запись.ДатаПолучения <> ДатаКлиента Тогда
			Результат.ЕстьИзменения = Истина;
			Результат.ДанныеJSON = Строка(Запись.ДанныеJSON);
			Результат.Предупреждения = ПрочитатьJSONМассивСнимка(Запись.ПредупрежденияJSON);
			Если Раздел <> РазделРазмещения() Тогда
				Обработка = Обработки.d3_v4.Создать();
				НачалоРазбора = ТекущаяУниверсальнаяДатаВМиллисекундах();
				Результат.Объекты = Обработка.ПрочитатьОбъектыСцены(Запись.ДанныеJSON);
				Результат.ДлительностьРазбораМс = ДлительностьМиллисекунд(НачалоРазбора);
				Если Результат.КоличествоОбъектов = 0 Тогда
					Результат.КоличествоОбъектов = КоличествоОбъектовСнимка(Результат.Объекты);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
		Результат.Ошибка = Истина;
		Результат.ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат.ЕстьИзменения = Ложь;
		Результат.Объекты = Неопределено;
		Результат.ДанныеJSON = "";
	КонецПопытки;
	Возврат Результат;

КонецФункции

Функция ПрочитатьJSONМассивСнимка(ТекстJSON)

	Если Не ЗначениеЗаполнено(ТекстJSON) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Значение = ПрочитатьJSON(Чтение);
	Если ТипЗнч(Значение) <> Тип("Массив") Тогда
		Возврат Новый Массив;
	КонецЕсли;
	Возврат Значение;

КонецФункции

Функция ДлительностьМиллисекунд(НачалоМс)

	Разница = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоМс;
	Если Разница < 0 Тогда
		Возврат 0;
	КонецЕсли;
	Возврат Разница;

КонецФункции

Функция СобратьСекциюТехники(ПериодКлиента)

	Результат = Новый Структура;
	Результат.Вставить("ЕстьИзменения", Ложь);
	Результат.Вставить("ПериодСнимка", ПериодКлиента);
	Результат.Вставить("Объекты", Неопределено);
	Результат.Вставить("Ошибка", Ложь);
	Результат.Вставить("ТекстОшибки", "");

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(Положение.Период) КАК Период
		|ИЗ
		|	РегистрСведений.ПоложениеТехникиСкаут КАК Положение";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Не Выборка.Следующий() Или Не ЗначениеЗаполнено(Выборка.Период) Тогда
			Возврат Результат;
		КонецЕсли;
		Если Выборка.Период = ПериодКлиента Тогда
			Результат.ПериодСнимка = Выборка.Период;
			Возврат Результат;
		КонецЕсли;
		Обработка = Обработки.d3_v4.Создать();
		Результат.ЕстьИзменения = Истина;
		Результат.ПериодСнимка = Выборка.Период;
		Результат.Объекты = Обработка.СобратьТехникуСкаут();
	Исключение
		Результат.Ошибка = Истина;
		Результат.ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Результат.ЕстьИзменения = Ложь;
		Результат.Объекты = Неопределено;
	КонецПопытки;
	Возврат Результат;

КонецФункции

Процедура ЗаписатьОшибку(ИмяСобытия, Информация)

	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(Информация));

КонецПроцедуры

#КонецОбласти

#КонецЕсли
